In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
from matplotlib import pyplot as plt

In [2]:
opentable= pd.read_csv('opentablecleaned.csv')

In [3]:
opentable.sort_values('promoted',ascending = False).head()

,Unnamed: 0,area,cost,cuisine,link,location,name,promoted,rating,review_count,review_link
6514,6514,London,3,Italian,https://www.opentable.com/r/brunello-restauran...,Kensington,Brunello Restaurant at the Baglioni Hotel,True,4.4,167.0,https://www.opentable.com/r/brunello-restauran...
4720,4720,London,3,Steak,https://www.opentable.com/r/the-banc-london?av...,Harringay,The Banc,True,4.4,463.0,https://www.opentable.com/r/the-banc-london?av...
62198,62198,New York / Tri-State Area,2,Italian,https://www.opentable.com/magna-restaurant?avt...,Flushing,Magna Restaurant,True,4.6,212.0,https://www.opentable.com/magna-restaurant?avt...
5912,5912,London,2,Dining Bar,https://www.opentable.com/r/kuku-riku-london?a...,Camden Town,Kuku Riku,True,NaN,3.0,https://www.opentable.com/r/kuku-riku-london?a...
133790,133790,Dallas - Fort Worth,4,Contemporary American,https://www.opentable.com/r/the-rosewood-mansi...,Turtle Creek / Oak Lawn,The Mansion Restaurant at Rosewood Mansion on ...,True,4.7,2184.0,https://www.opentable.com/r/the-rosewood-mansi...

In [4]:
opentable.isna().sum()

Unnamed: 0           0
area                 0
cost                 0
cuisine              0
link                 0
location             0
name                 0
promoted             0
rating          121681
review_count    120660
review_link          0
dtype: int64

In [5]:
#without links
ot = opentable[['area','location','name','cuisine','cost','rating','review_count','promoted']]
ot.head()

,area,location,name,cuisine,cost,rating,review_count,promoted
0,Atlanta / Georgia,Airport / College Park,Spice House on Cascade,Caribbean,2,NaN,NaN,False
1,Atlanta / Georgia,Lilburn,Royal Restaurant and Sweets,Mediterranean,3,NaN,NaN,False
2,Atlanta / Georgia,Smyrna,Bollywood Zing,Italian,3,NaN,NaN,False
3,Atlanta / Georgia,Buckhead,Sushi Bar Yu-Ka,Steakhouse,3,NaN,NaN,False
4,Essex,Ilford,Adana,Turkish,2,NaN,NaN,False

In [6]:
len(ot)

163788

In [7]:
rating_without_reviews = ot.rating.isna().sum() - ot.review_count.isna().sum()
rating_without_reviews

1021

In [8]:
percent_missing_rating = str(round(((ot.rating.isna().sum()/len(ot))*100),2)) +'%'
percent_missing_rating

'74.29%'

# Groupings
## Grouped by area

In [9]:
grouped_area_size = pd.DataFrame(ot.groupby('area').size(),columns = ['restaurant_count'])

In [10]:
grouped_area_size

                                          restaurant_count
area
Atlanta / Georgia                                     6104
Atlantic Canada                                       1069
Baja California Sur                                    167
Barcelona                                              966
Berlin                                                1698
Boston / New England                                 10000
Calgary / Southern Alberta                            1458
Cancun / Riviera Maya                                  364
Chicago / Illinois                                   10000
Dallas - Fort Worth                                   5637
Denver / Colorado                                     4804
Detroit / Eastern Michigan                            4261
Dublin                                                 654
Edinburgh/Midlothian                                   756
Edmonton / Northern Alberta                           1074
Essex                                                  374
Frankfurt / Taunus                                     459
Glasgow/Lanarkshire                                    493
Hamburg / Hamburg Area                                 620
Houston                                               5638
Indiana                                               3909
Italy                                                 1481
Kanagawa                                               105
Kent                                                   593
Las Vegas                                             2141
London                                                5462
Los Angeles                                          10000
Madrid                                                 943
Manchester/Greater Manchester                          471
Mexico City                                           1017
Miami / Southeast Florida                             5985
Monterrey                                              182
Montreal / Quebec                                     3971
Munich / Lower Bavaria / Bavarian Swabia              1305
New York / Tri-State Area                            10000
Orlando / Central Florida East                        4325
Philadelphia / New Jersey Suburbs                     8681
Portland / Oregon                                     4241
San Francisco Bay Area                                8499
Seattle / Eastern Washington                          6247
Stuttgart / East Baden-Württemberg                     240
Tokyo Metropolitan Area                               1115
Toronto / Ontario                                     7412
Vancouver / British Columbia                          4563
Virginia                                              3921
Washington, D.C. Area                                 4623
Wisconsin                                             4951
Yorkshire                                              809

In [11]:
grouped_area_size.sort_values('restaurant_count',ascending = False).head(10)

                                   restaurant_count
area
Los Angeles                                   10000
Chicago / Illinois                            10000
New York / Tri-State Area                     10000
Boston / New England                          10000
Philadelphia / New Jersey Suburbs              8681
San Francisco Bay Area                         8499
Toronto / Ontario                              7412
Seattle / Eastern Washington                   6247
Atlanta / Georgia                              6104
Miami / Southeast Florida                      5985

## Grouped by location

In [12]:
grouped_location_size = pd.DataFrame(ot.groupby('location').size(),columns = ['restaurant_count'])

In [13]:
len(grouped_location_size)

3831

In [14]:
grouped_location_size.sort_values('restaurant_count', ascending = False).head(10)

           restaurant_count
location
Downtown               2599
Sooke                  1211
Detroit                1135
Richmond                893
Milwaukee               686
Arlington               632
Calgary                 624
Montreal                590
Bronx                   575
Hollywood               562

## Grouped by cost

In [15]:
grouped_cost_size = pd.DataFrame(ot.groupby('cost').size(),columns = ['restaurant_count'])

In [16]:
grouped_cost_size

      restaurant_count
cost
2               138849
3                19753
4                 5186

## Group by promoted

In [17]:
grouped_promoted_size = pd.DataFrame(ot.groupby('promoted').size(),columns = ['restaurant_count'])

In [18]:
grouped_promoted_size

          restaurant_count
promoted
False               163474
True                   314

In [19]:
grouped_promoted = ot.groupby('promoted')